tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "kylef/formulae"
tap "oven-sh/bun"
tap "unisonweb/unison"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Record and share terminal sessions
brew "asciinema"
# Spell checker with better logic than ispell
brew "aspell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Audit Cargo.lock files for crates with security vulnerabilities
brew "cargo-audit"
# Next-generation test runner for Rust
brew "cargo-nextest"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Diff that understands syntax
brew "difftastic"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# More intuitive version of du in rust
brew "dust"
# Lean Theorem Prover installer and version manager
brew "elan-init"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line benchmarking tool
brew "hyperfine"
# Git-compatible distributed version control system
brew "jj"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Create modern online books from Markdown files
brew "mdbook"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Remote terminal application
brew "mosh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Modern replacement for ps written in Rust
brew "procs"
# Command-line interface for Render
brew "render"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Intuitive find & replace CLI
brew "sd"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Swift version manager
brew "kylef/formulae/swiftenv"
# Unison [Language] and Codebase Manager
brew "unisonweb/unison/unison-language"
# Command-line interface for 1Password
cask "1password-cli"
cask "font-hack"
# Open-source keystroke visualiser
cask "keycastr"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Speech recognition tool
cask "macwhisper"
# Get up and running with large language models locally
cask "ollama"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
vscode "13xforever.language-x86-64-assembly"
vscode "achkasov.ibm-carbon-design-system-theme"
vscode "adpyke.codesnap"
vscode "alekangelov.alek-kai-theme"
vscode "alexcvzz.vscode-sqlite"
vscode "andrewleedham.vscode-css-modules"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "carlosjs23.vscode-yarn-script"
vscode "christian-kohler.npm-intellisense"
vscode "dan-c-underwood.arm"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "denco.confluence-markup"
vscode "dnicolson.binary-plist"
vscode "douglaszaltron.nunjucks-vscode-extensionpack"
vscode "dprint.dprint"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fmoronzirfas.open-in-marked"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql-syntax"
vscode "haskell.haskell"
vscode "hbenl.vscode-test-explorer"
vscode "huacnlee.theme-macos-classic"
vscode "ibm.output-colorizer"
vscode "janisdd.vscode-edit-csv"
vscode "justusadam.language-haskell"
vscode "kaiwood.center-editor-window"
vscode "kasik96.swift"
vscode "kevinkyang.auto-comment-blocks"
vscode "mateocerquetella.xcode-12-theme"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "mitsuhiko.insta"
vscode "mrmlnc.vscode-json5"
vscode "mrmlnc.vscode-scss"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicolaiverbaarschot.alabaster-variant-theme"
vscode "pest.pest-ide-tools"
vscode "quicktype.quicktype"
vscode "rahmanyerli.ra-spring"
vscode "rbuckton.tsserver-live-reload"
vscode "redhat.vscode-yaml"
vscode "rickynormandeau.mariana-pro"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.night-owl"
vscode "seaql.firedbg-rust"
vscode "shuworks.vscode-table-formatter"
vscode "skyapps.fish-vscode"
vscode "stkb.rewrap"
vscode "swashata.beautiful-ui"
vscode "swindh.enumerator"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tobiastimm.raiju"
vscode "tyriar.sort-lines"
vscode "unison-lang.unison"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
vscode "xseman.simple-light"
vscode "yzhang.markdown-all-in-one"
